/*
Navicat MySQL Data Transfer

Source Server         : zcjc
Source Server Version : 50711
Source Host           : localhost:3306
Source Database       : istxt

Target Server Type    : MYSQL
Target Server Version : 50711
File Encoding         : 65001

Date: 2016-05-13 11:52:59
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for category
-- ----------------------------
DROP TABLE IF EXISTS `category`;
CREATE TABLE `category` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `UNIQ_64C19C15E237E06` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of category
-- ----------------------------
INSERT INTO `category` VALUES ('1', '爱情');
INSERT INTO `category` VALUES ('3', '狗日的生活');
INSERT INTO `category` VALUES ('2', '谁在乎呢');

-- ----------------------------
-- Table structure for isdoc
-- ----------------------------
DROP TABLE IF EXISTS `isdoc`;
CREATE TABLE `isdoc` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `category_id` int(11) DEFAULT NULL,
  `type` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `company` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '公司',
  `position` varchar(255) CHARACTER SET utf8 NOT NULL COMMENT '位置',
  `description` longtext CHARACTER SET utf8 NOT NULL,
  `is_public` tinyint(1) DEFAULT NULL,
  `is_activated` tinyint(1) DEFAULT NULL,
  `email` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `expires_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `IDX_528AC92512469DE2` (`category_id`),
  CONSTRAINT `FK_528AC92512469DE2` FOREIGN KEY (`category_id`) REFERENCES `category` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of isdoc
-- ----------------------------
INSERT INTO `isdoc` VALUES ('3', '1', 'txt', '梦想', '梦想', '五月是杜鹃花盛开的季节，\r\n\r\n在阳光的照射下，\r\n\r\n像白里透红的佳人。\r\n\r\n在微风的吹拂下，\r\n\r\n犹如长裙飘飘的少女。\r\n\r\n枝上的花像一个个盛开的梦。( 文章阅读\r\n\r\n同山岚摇曳，与云雾共舞。\r\n\r\n假如我的梦想可以自由飞翔，\r\n\r\n那么我庆幸自己是一个幸运的人。\r\n\r\n可是梦想终像一艘搁浅的孤船，\r\n\r\n无论我多么想踮起脚尖，\r\n\r\n摸到太阳的脸颊；\r\n\r\n无论我多么想偷偷乘着萤火虫，\r\n\r\n抵达月亮的宫殿；\r\n\r\n满天星星眨着眼告诉我，\r\n\r\n银河是一片永难泅渡的海。\r\n', '2', '2', '5435@qq.com', '2016-06-08 21:25:45', '2016-05-04 21:25:55', '2016-05-05 21:26:01');
INSERT INTO `isdoc` VALUES ('4', '3', 'pdf', '第4条', '奈何桥上的最后一次回眸', '奈何桥上的最后一次回眸，把对红尘的最后一丝留恋化成那苍白双颊的两行清泪。泪入孟婆汤，驻首三生石，前世今生，重重轮回浮现眼前，千世的冰封，万年的孤寂，那一刻全部回归于寂静。奈何前世的离别，奈何今生的相见，奈何来世的重逢。浮生若梦，百折千回！', '1', '1', '43545@qq.com', '2016-06-24 22:35:50', '2016-05-09 22:36:02', '2016-05-09 22:36:07');
INSERT INTO `isdoc` VALUES ('5', '2', 'txt', '第5条', '一座桥，名为奈何', '一座桥，名为奈何。一条河，名为忘川。三生石畔，伊人仍旧。愿，陪君醉笑三千场，不诉离殇。忆，美人如玉，破碎虚空。惜，飞鸿过尽字字愁，情难思量。境花水月弹指间。他，笑饮孟婆汤。她，不掬美人泪。和雨烟雨两不胜，天上人间一样愁。若有来生，为君倾城。这份爱，谁懂！', '2', '2', '4324', '2016-06-08 22:36:52', '2016-05-09 21:37:04', '2016-05-09 22:37:11');
INSERT INTO `isdoc` VALUES ('6', '1', 'txt', '第6条', '职场如同江湖', '职场如同江湖，江湖有江湖的规矩，职场有职场的原则，如果不懂规矩，只会被淘汰，有时候年轻并不是一种优势。', '2', '1', '5435', '2016-06-23 22:38:47', '2016-05-08 22:38:56', '2016-05-09 22:39:01');
INSERT INTO `isdoc` VALUES ('7', '2', 'txt', 'ss', '玫瑰花有刺', '玫瑰花有刺，却不会有人因为刺而讨厌它，真有那样的，也不是真正爱花的。', '1', '1', '434', '2016-07-07 23:10:11', '2016-05-18 23:10:18', '2016-05-04 23:10:23');
INSERT INTO `isdoc` VALUES ('8', '3', 'txt', 'dd', '没秒回，并不代表我不在乎你', '没秒回，并不代表我不在乎你没秒回，并不代表我不在乎你没秒回，并不代表我不在乎你没秒回，并不代表我不在乎你没秒回，并不代表我不在乎你', '2', '1', '4345', '2016-06-10 06:21:48', '2016-05-09 06:21:54', '2016-05-10 06:21:58');
INSERT INTO `isdoc` VALUES ('9', '3', 'txt', 'gg', '我被自己蠢哭了', 'symfony 真的很不优雅 也怪我蠢\r\n用ajax请求数据库里数据 配好路由 发现response回来的是空json？\r\nJsonResponse到底哪里用错了 还有那些参数那些用法我不清楚吗 \r\n各种查 各种搜 一个小时后 发现尼玛数据库本来就没有这个id的数据\r\n瞬间想哭 怎么能这么蠢\r\n\r\n换了id还是取不到 又是各种测 发现JsonResponse接收处理是数组和字符\r\n而orm出来的不是一个数组 具体叫什么我也不清楚 就称为数据吧\r\n反正JsonResponse 不认这个东西 那怎么办 又是各种查手册各种搜  \r\n这么强大的框架肯定有提供处理方法的 又一个小时后 查到说要引入接口处理\r\n太复杂了 太 难搞了 终于看到一个介绍用symfoney下ajax实现更新和删除的帖子\r\n就尼玛不介绍查询的方法 还好有人留言说私有属性返回的是空json 果断将entity里所以\r\n属性改为public 果然可行 具体为什么我也不知道 懒得去研究 \r\n\r\n问题又来了 用的edge浏览器f12发现数据都是unicode码 为什么不是中文\r\n为什么不是中文 为什么不是中文 明明所有编码都是统一的 打印出来也都是unicode码\r\n又是各种搜各种查。。\r\n正在苦恼之际 无意用了谷歌浏览器 JsonResponse返回到页面还是unicode码 但通过ajax返回的是中文\r\n没错是中文 是可以使用的 怎么回事 又想哭了\r\n明明可以不用管这个unicode码 还纠结怎样转码 以前怎么没注意这个细节 被自己蠢哭了\r\n原来json_encode函数处理中文是会有这样的情况的 JsonResponse这个类也用了这个\r\n函数 可是不是说低版本php才有这个情况吗 我用的是php7 也不知道哪里问题 反正不用管编码问题\r\n就是了 百度还那么多人问处理ajax返回的编码问题 呵呵', '1', '1', '5646', '2016-06-10 08:13:11', '2016-05-10 08:13:18', '2016-05-10 08:13:22');
INSERT INTO `isdoc` VALUES ('10', '2', 'txt', '44', '贱人永远都是贱人，就算经济危机了，你也贵不了！', '贱人永远都是贱人，就算经济危机了，你也贵不了！贱人永远都是贱人，就算经济危机了，你也贵不了！贱人永远都是贱人，就算经济危机了，你也贵不了！贱人永远都是贱人，就算经济危机了，你也贵不了！贱人永远都是贱人，就算经济危机了，你也贵不了！贱人永远都是贱人，就算经济危机了，你也贵不了！贱人永远都是贱人，就算经济危机了，你也贵不了！', '1', '1', 'gfdg', '2016-07-08 00:30:33', '2016-05-12 00:30:40', '2016-05-12 00:30:44');
INSERT INTO `isdoc` VALUES ('11', '2', 'txt', 'gf', '.流血一周不死的生物也只有女人。', '.流血一周不死的生物也只有女人。.流血一周不死的生物也只有女人。.流血一周不死的生物也只有女人。.流血一周不死的生物也只有女人。', '1', '1', 'fdsf', '2016-06-01 00:31:36', '2016-05-12 00:31:41', '2016-05-12 00:31:45');
INSERT INTO `isdoc` VALUES ('12', '1', 'txt', 'fdf', '你有你的背景，我有我的故事', '你有你的背景，我有我的故事。没有读懂我的故事，别给我多余的评价。别用昨日的眼光 ，看今日的我。', '2', '2', '43', '2016-07-01 00:33:02', '2016-05-12 00:33:07', '2016-05-12 00:33:10');
INSERT INTO `isdoc` VALUES ('13', '2', 'txt', 'fdgd', '给时间一点时间，让过去过去，让开始开始。', '给时间一点时间，让过去过去，让开始开始。给时间一点时间，让过去过去，让开始开始。给时间一点时间，让过去过去，让开始开始。给时间一点时间，让过去过去，让开始开始。给时间一点时间，让过去过去，让开始开始。', '1', '1', 'fds', '2016-06-01 00:33:38', '2016-05-03 00:33:43', '2016-05-04 00:33:47');
INSERT INTO `isdoc` VALUES ('14', '1', 'txt', 'fdsg', '现在的我，你不好好珍惜，以后的我，你高攀不起', '现在的我，你不好好珍惜，以后的我，你高攀不起现在的我，你不好好珍惜，以后的我，你高攀不起现在的我，你不好好珍惜，以后的我，你高攀不起现在的我，你不好好珍惜，以后的我，你高攀不起现在的我，你不好好珍惜，以后的我，你高攀不起', '1', '1', 'rerer', '2016-07-01 00:34:38', '2016-05-12 00:34:44', '2016-05-12 00:34:46');
INSERT INTO `isdoc` VALUES ('15', '2', 'txt', 'grfg', '会感觉「后悔」是因为认为相较现在', '会感觉「后悔」是因为认为相较现在，要是当时怎样怎样应该会是更好的状况，是一种以某个好状况所设定的结果论，但这个不存在的结果是不是你真的最想要的，永远没有人会知道，包括你在内，所以没有什么好后悔的，想要什么就尽力去做，珍惜你的决定和努力带你到达的现在，人生就如此而已。', '2', '2', 'ftrer', '2016-07-09 00:36:06', '2016-05-12 00:36:15', '2016-05-12 00:36:17');
INSERT INTO `isdoc` VALUES ('16', '3', null, null, '好饿好饿好饿 我真的好饿', '明明今天上午 吃了五碗面\r\n可是非常奇怪 现在就饿鸟\r\n他们总是说我 平时吃太多\r\n但是人家真的 真的容易饿\r\n一旦自己觉得 肚子非常饿\r\n吐字会不清晰 舌头打卷了\r\n还会全身无力 唱歌跑掉了\r\n这样她们又要嫌弃我鸟\r\n', '1', null, null, '2016-06-11 21:18:28', '2016-05-12 21:18:28', null);
INSERT INTO `isdoc` VALUES ('17', '2', null, null, '日了狗了是一种什么样的体验', '狗：“我他妈和你做朋友!你却想着上我？!”\r\n狗：“我他妈和你做朋友!你却想着上我？!”\r\n狗：“我他妈和你做朋友!你却想着上我？!”\r\n狗：“我他妈和你做朋友!你却想着上我？!”\r\n狗：“我他妈和你做朋友!你却想着上我？!”\r\n狗：“我他妈和你做朋友!你却想着上我？!”\r\n狗：“我他妈和你做朋友!你却想着上我？!”\r\n狗：“我他妈和你做朋友!你却想着上我？!”\r\n狗：“我他妈和你做朋友!你却想着上我？!”\r\n狗：“我他妈和你做朋友!你却想着上我？!”', '1', null, null, '2016-06-11 21:25:27', '2016-05-12 21:25:27', null);
INSERT INTO `isdoc` VALUES ('18', '1', null, null, '你还要我怎样要怎样', '你还要我怎样要怎样\r\n你突然来的短信就够我悲伤\r\n我没能力遗忘你不用提醒我 哪怕结局就这样\r\n我还能怎样能怎样\r\n最后还不是落得情人的立场\r\n你从来不会想我何必这样\r\n我慢慢的回到自己的生活圈\r\n也开始可以接触新的人选\r\n爱你到最后不痛不痒\r\n留言在计较谁爱过一场\r\n我剩下一张没后悔的模样\r\n你还要我怎样要怎样\r\n你千万不要在我婚礼的现场\r\n我听完你爱的歌就上了车 爱过你很值得\r\n我不要你怎样没怎样\r\n我陪你走的路你不能忘\r\n因为那是我最快乐的时光\r\n后来我的生活还算理想\r\n没为你落到孤单的下场\r\n有一天晚上梦一场\r\n你白发苍苍说带我流浪\r\n我还是没犹豫就随你去天堂\r\n不管能怎样我能陪你到天亮 ', '1', null, null, '2016-06-11 21:42:09', '2016-05-12 21:42:09', null);
INSERT INTO `isdoc` VALUES ('19', '3', null, null, '我亮NMLGB，我会失手？', '3楼傻逼，有人会问我，你这话骂了自己咋办，哥笑了，以哥850马力的手速，F5的速度，还能抢不到2楼？另外我要操3楼狗头，暴3楼菊花，顺便射3楼一脸，抢2楼，玩的就是心跳，万一我失手了，他们肯定会说3楼亮了，我亮NMLGB，我会失手？失你MLGB... 顺便大声的告诉我这是几楼', '1', null, null, '2016-06-11 22:46:51', '2016-05-12 22:46:51', null);
INSERT INTO `isdoc` VALUES ('20', '3', null, null, '国家新政 国家新政', '今天国家对以下11个成语重新作出解释，现公布于共享，望各位认真学习领会，贯彻落实：\r\n1.【夫唱妇随】丈夫去歌厅，老婆尾随跟踪。\r\n2.【度日如年】表示日子非常好过，每天象过年一样。\r\n3.【杯水车薪】形容每天上班办公室喝杯茶，月底可以拿到买一辆车的工资。\r\n4.【知足常乐】知道有人请自己洗脚，心里就感到快乐。\r\n　5.【见异思迁】看见漂亮的异性就想搬到她那里去住。\r\n6.【语重心长】别人话讲的重了，心里怀恨很长时间。\r\n7.【知书达礼】仅知道书本知识是不够的，还要学会送礼。\r\n8.【朝三暮四】早上和小三儿一起，晚上和小四儿一起。\r\n9.【穷途末路】现在路上收费增高，让穷人无路可走。\r\n10.【一穷二白】人一变穷，别人就会用两个白眼看你。\r\n11.【无微不至】没有微信的地方不要去。', '1', null, null, '2016-06-11 23:03:46', '2016-05-12 23:03:46', null);
INSERT INTO `isdoc` VALUES ('21', '1', null, null, '是不是这样的啊', '是不是这样的啊是不是这样的啊是不是这样的啊是不是这样的啊是不是这样的啊是不是这样的啊是不是这样的啊是不是这样的啊', '1', null, null, '2016-06-12 02:45:23', '2016-05-13 02:45:23', null);
INSERT INTO `isdoc` VALUES ('22', '2', null, null, '别这样 不要这样', '别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样别这样 不要这样', '1', null, null, '2016-06-12 02:47:27', '2016-05-13 02:47:27', null);
INSERT INTO `isdoc` VALUES ('23', '1', null, null, 'mlgbmlgb马勒戈壁', 'mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁mlgbmlgb马勒戈壁', '1', null, null, '2016-06-12 02:49:30', '2016-05-13 02:49:30', null);
